 [
    {
        "name": "Sanjay Prasad",
        "imgSrc": "lib/assets/images/people/sanjay.jpg",
        "position": "PhD Student",
        "credentials": [
            "B.Pharma.: Muzaffarpur Institute of Technology, Bihar University, Muzaffarpur",
            "M.Tech in Biotechnology, Anna University, Chennai",
            "Present Status: Senior Scientific Officer, Dept. of IPC, IISc, Bangalore"
        ],
        "summary":["Nanoparticles with enzyme-like activity gained significant importance in therapeutic applications against oxidative stress-related disorders. Particularly, nanozymes having multiple SOD and GPx activity attracted greater attention recently. These nanoenzymes mimic cellular antioxidant enzymes and protect biomolecules against ROS. Therefore, the synthesis of a novel nanomaterial with robust antioxidant property is of significant biomedical importance. Therefore, the present study focused on to synthesize a novel ZnO and Cu-doped ZnO (Cu-ZnO) based nanoparticles to mimic the SOD enzyme. The Cu-doped ZnO nanoparticles were synthesized successfully by Chemical Precipitation/Co-precipitation method and the doping were confirmed by spectroscopic methods including, SEM, TEM, Raman Spectroscopy, PXRD and XPS. In vitro studies highlight that, the Cu-doped ZnO nanoparticles did not exhibit robust SOD activity as compared to earlier reported Mn3O4 based nanozymes. Therefore, additional methodologies are currently employed to synthesize different morphology-based nanoparticles of Cu-doped with ZnO."]
    },
    {
        "name": "Anjali Deep",
        "imgSrc": "lib/assets/images/people/anjali.jpg",
        "position": "Integrated PhD Student",
        "credentials": ["BSc (hons) in zoology, Hansraj College, Delhi University."],
        "fellowships": "IISc Fellowship",
        "summary":["Mitochondria are energy-generating eukaryotic organelles that play an indispensable role in several cellular processes. Owing to their involvement in crucial pathways, they are critical in cell survival. Moreover, several pathological conditions have been associated with the malfunctioning of mitochondria. To date, myriads of genes have been implicated in maintaining mitochondrial homeostasis. However, the complete repertoire of genes required for mitochondrial functioning remains unknown. While significant progress has been made in characterizing the essential genes involved in maintaining mitochondrial health, the importance of non-essential genes remains unexplored. In our study, we have utilized a yeast non-essential gene deletion library to identify uncharacterized candidates involved in mitochondrial structure and function."]
    },
    {
        "name": "Sananda Biswas",
        "imgSrc": "lib/assets/images/people/sananda.jpg",
        "position": "PhD Student",
        "summary":["Mitochondria are dynamic organelles that maintain a fusion-fission balance in response to cellular cues. Maintenance of a balanced fission-fusion cycle is necessary for cellular homeostasis and stress adaptation. Perturbed mitochondrial dynamics have been reported to cause nerodegenerative disorders, cancer, and metabolic diseases. Studies in our lab, using Saccharomyces cerevisiae as the model organism, indicate the role of Hsp31 mini-family proteins in maintaining mitochondrial dynamics and redox homeostasis. My work majorly focuses on understanding the mechanism by which Hsp31 mini-family proteins contribute to the maintenance of mitochondrial dynamics, redox status, and overall cellular health."]
    },
    {
        "name": "Aishita Chakraborty",
        "imgSrc": "lib/assets/images/people/aishita.jpg",
        "position": "PhD Student",
        "credentials": [
            "B.Sc in Microbiology (Hons.), Surendranath College, University of Calcutta",
            "MSc in Microbiology, St. Xavier's College, Kolkata, University of Calcutta"
        ],
        "summary": ["Mitochondria are an elementary organelle in eukaryotic cells having pivotal functions in bioenergetics, metabolism and apoptosis. Mitochondrial protein import machinery controls cellular metabolism, signaling, stress and pathogenesis of disease. The protein import activity acts as an indicator of mitochondrial health by means of regulating biogenesis, composition and turnover of mitochondria. Import of nuclear encoded mitochondrial protein requires different import machineries called translocons. In the inner mitochondrial membrane TIM 22 complex is required for the insertion of polytopic proteins.<br> I am interested in studying whether Tim22 complex is involved in biogenesis of mitochondrial respiratory chain components and how it functions in that respect. I will be also testing how these proteins are imported and do they have any specific physiological role. Mitochondrial Nde 1( NADH dehydrogenase) homologue of AIF in human, is known to execute cell death apart from their role in ETC. The idea is to look if TIM 22 complex has interactions with Nde1 and it's activities in the respiratory chain complex assembly."],
        "fellowships": "DBT-JRF fellowship"
    },
    {
        "name": "Aakansha Paliwal",
        "imgSrc": "lib/assets/images/people/akansha.jpg",
        "position": "PhD Student",
        "fellowships": "PMRF fellowship"
    },
    {
        "name": "Ashutosh Narayan Bhasker",
        "imgSrc": "lib/assets/images/people/ashutosh.jpg",
        "position": "Integrated PhD Student"
    },
    {
        "name": "Muskan Agarwal",
        "imgSrc": "lib/assets/images/people/muskan.jpg",
        "position": "PhD Student",
        "credentials": [
            "Bsc. (Hons.) Biochemistry from Aligarh Muslim University",
            "Msc. Life Science from Jawaharlal Nehru University, Delhi."
        ]
    },
    {
        "name": "Shruti Agarwal",
        "imgSrc": "lib/assets/images/people/sruthi.jpg",
        "position": "PhD Student",
        "credentials": [
            "B.Sc. in Zoology Honours, South Calcutta Girls College, University of Calcutta",
            "M.Sc. in Biophysics and Molecular Biology, University of Calcutta"
        ]
    }
]