 {
    "title": "Dr. ",
    "name": "Patrick D' Silva",
    "imgSrc": "lib/assets/images/people/patrick.webp",
    "position": "Professor",
    "email": "patrick@iisc.ac.in",
    "credentials": ["Ph.D: Indian Institute of Technology, Powai-Bombay", "PDF: University of Wisconsin-Madison, USA"],
    "started": "2007",
    "summary": [
        {
            "list": {
                "title": "Highlights",
                "array": [
                    "Elucidated intricate organization & moonlighting functions of pre-sequence translocase",
                    "Characterized therapeutic potential of nanozymes against oxidative stress disorders"
                ]
            },
            "text": ["Our lab research focusses on uncovering the pathways of mitochondrial protein translocation, biogenesis and turnover in connection to various pathophysiological conditions. By utilizing yeast and mammalian model systems, my lab will investigate the key regulatory mechanisms of redox homeostasis, protein trafficking & folding and organellar life cycle using a combination of experimental tools from genetics and cell biology with biochemistry."]
        },
        {
            "imgSrc": "lib/assets/images/people/research/patrick-research.webp",
            "text": ["Elucidating the organization of pre-sequence translocase and mechanisms of protein translocation across the mitochondria. Our studies delineate firsttime intricate organization of human pre-sequence translocase, which is significantly different from the yeast system. Our finding highlights the presence of 3 different translocase machinery for protein import across the mitochondrial inner membrane. Two of the translocases (B1 & B2) are essential for constitutive functions and translocase A found to be oncogenic in nature. Moreover, we uncovered that one of the components of the presequence machinery is involved in regulating apoptotic pathways thus imparting the chemoresistance in cancer cells. Our research findings provided first-time a direct connection between translocation machinery and the development of tumorigenicity. Our future long-term goal is to: (1) characterize the mitochondrial import motor and translocation machinery; (2) elucidate the mechanism and regulation of import motor component’s interactions with TIM23 channel to understand fundamental aspects of the mitochondrial protein transport process with respect to mitochondrial biogenesis in higher organisms; 3) characterize the organization of carrier translocase in connection to mitochondrial inner membrane protein biogenesis."]
        }
    ],
    "awards": [
        {
            "name": "SIR. C.V. RAMAN KARNATAKA STATE SCIENCE AWARD, LIFE SCIENCES",
            "from": "Government of Karnataka, India",
            "year": "2017"
        },
        {
            "name": "FELLOW OF NATIONAL ACADEMY OF SCIENCES",
            "from": "National Academy of Sciences (NASI), Allahabad",
            "year": "2017"
        },
        {
            "name": "EXCELLENCE IN DRUG RESEARCH IN LIFE SCIENCES",
            "from": "CSIR-Central Drug Research Institute, Lucknow.",
            "year": "2016"
        },
        {
            "name": "NATIONAL BIOSCIENCE AWARD",
            "from": "Department of Biotechnology, India",
            "year": "2014"
        },
        {
            "name": "YOUNG RESEARCHER AWARD",
            "from": "Sir Dorabji Tata and allied Trust",
            "year": "2012"
        },
        {
            "name": "SWARNAJAYANTHI FELLOWSHIP AWARD IN LIFE SCIENCES",
            "from": "Ministry of Science and Technology, DST, India",
            "year": "2012"
        },
        {
            "name": "BM BIRLA SCIENCE PRIZE AWARD FOR BIOLOGICAL SCIENCES",
            "from": "Birla Science Foundation",
            "year": "2011"
        },
        {
            "name": "SENIOR RESEARCH FELLOWSHIP IN BIOMEDICAL SCIENCES",
            "from": "Wellcome Trust Foundation-UK",
            "year": "2007"
        }
    ]
}