[
    {
        "title": "Name of the Faculty Member: Prof. Patrick D’Silva",
        "content": {
            "heading": "Research in my Laboratory:",
            "topics": [
                {
                    "subHeading": "1) Our goal is to elucidate the effect of DJ-1 mutations in the PD-progression using neuronal cells and genetic manipulation using S cerevisiae as a model system.",
                    "content": [
                        "The association of ROS is well-known in several pathological conditions, including neurodegeneration, cancer progression, type two diabetes mellitus, and atherosclerosis. Recently our lab discovered a novel group of proteins called the DJ-1/Park7 family involved in ROS sensing and maintaining organellar functions, especially mitochondria. The molecular mechanisms behind how DJ-1/Park7 family members protect the organellar-specific functions and macromolecules are still enigmatic. In addition, the mutations in DJ-1/Park7 are well-known to develop the familial form of Parkinson's disease. ",
                        "Our goal is to elucidate the effect of DJ-1 mutations in the PD-progression using neuronal cells and genetic manipulation using S cerevisiae as a model system"
                    ]
                },
                {
                    "subHeading": "2) Role of Heat Shock Proteins in Health and Diseases:",
                    "content": [
                        "The stress-protective heat-shock proteins are often overexpressed in cells of various cancers and have been suggested to contribute to many pathological conditions.",
                        "Therefore, the involvement of chaperones in such diverse roles suggests novel therapeutic approaches by targeting heat-shock protein function for a broad spectrum of tumor types, various pathogenic disease states, and protein conformational diseases."
                    ]
                },
                {
                    "subHeading": "3) Understanding Maintenance of mitochondrial quality control: Implications in human health.",
                    "content": [
                        "Mitochondria are the most dynamic and complex organelles involved in a wide range of cellular events, which are essential for tissue adaptation, survival, death, and renewal.",
                        "Our long-term goal would be to address how the organelle maintains its dynamics (fission-fusion cycles), membrane potential, and turnover (biogenesis and clearance) in normal and pathophysiological conditions."
                    ]
                },
                {
                    "subHeading": "4) Elucidating the organization of pre-sequence translocase and mechanisms of protein translocation across the mitochondria.",
                    "content": [
                        "Our future long-term goal is to: (1) characterize the mitochondrial import motor and translocation machinery; (2) elucidate the mechanism and regulation of import motor component’s interactions with TIM23 channel to understand fundamental aspects of the mitochondrial protein transport process concerning mitochondrial biogenesis in higher organisms; 3) characterize the organization of carrier translocase in connection to mitochondrial inner membrane protein biogenesis."
                    ]
                }
            ],
            "contact": "http://pdslab.biochem.iisc.ac.in/  (Google Search word: Molecular chaperone labs/Mitochondria Biology Lab)    Twitter:  Mitochondrial Biology Lab  @pdslab_iisc",
            "focus": "Likely Research Topic(s):",
            "focusDetail": "a)Understanding the role of DJ-1/Park7 paralogs in the maintenance of redox homeostasis and organellar health: Implications in Parkinson's disease progression "
        },
        "vacancy": "Number of Vacancies: 01",
        "publications": [
            "Kumar A, Matta SK, D'Silva P. J Cell Sci. (2023) 136 (2): jcs260060.",
            "Prasad P, Priyanka K,…D’Silva P & Shivaprasad PV (2022) New Phytologist, 236(3), 1061-1074",
            "Kumar A, Matta SK, D'Silva P. J Cell Sci. (2020) Jul 29;133(14): JCS 244632",
            "Matta SK, Kumar A, D'Silva P. Mol Biol Cell. (2020) May 15;31(11):1112-1123",
            "Bankapalli K, Vishwanathan V, Susarla G, Sunayana N, Saladi S, Peethambaram D, D'Silva P. Redox Biol. (2020) May;32:101451"
        ]
    }
]